Revit 2026 API

# FormMoveSubElement Method

---

Move a face/edge/curve/vertex of the form, specified by a reference, and an offset vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MoveSubElement(
	Reference subElementReference,
	XYZ offset
)
```
```vb
Public Sub MoveSubElement (
	subElementReference As Reference,
	offset As XYZ
)
```
```cpp
public:
void MoveSubElement(
	Reference^ subElementReference,
	XYZ^ offset
)
```
```fsharp
member MoveSubElement :
        subElementReference : Reference *
        offset : XYZ -> unit
```

#### Parameters

subElementReference Reference
    The geometry reference of face/edge/curve/vertex
offset XYZ
     The vector by which the element is to be moved.

#### Reference

Form Class

Autodesk.Revit.DB Namespace